alemezdro/BLDC_Motor/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART_1.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "MISO_1_aliases.h"
#include "MISO_1.h"
#include "MOSI_1_aliases.h"
#include "MOSI_1.h"
#include "SCLK_1_aliases.h"
#include "SCLK_1.h"
#include "SPIM_1.h"
#include "SPIM_1_PVT.h"
#include "CS_1_aliases.h"
#include "CS_1.h"
#include "Pin_2_aliases.h"
#include "Pin_2.h"
#include "push_button_aliases.h"
#include "push_button.h"
#include "PWM_1.h"
#include "Clock_2.h"
#include "DMA_1_dma.h"
#include "dshot_pwm_aliases.h"
#include "dshot_pwm.h"
#include "UART_1_IntClock.h"
#include "SPIM_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

